[
  {
    "id": "1",
    "text": "A banana is a yellow fruit that is soft and sweet.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "2",
    "text": "A lemon is yellow and very sour.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "3",
    "text": "A chili pepper is red and extremely spicy.",
    "region": "Various",
    "type": "Spice"
  },
  {
    "id": "4",
    "text": "An apple can be red, green, or yellow and has a sweet taste.",
    "region": "Global",
    "type": "Fruit"
  },
  {
    "id": "5",
    "text": "Biryani is a flavorful Indian rice dish made with spices, rice, and usually meat or vegetables.",
    "region": "Hyderabad",
    "type": "Main Course"
  },
  {
    "id": "6",
    "text": "Samosa is a fried or baked pastry with a spicy potato filling, popular as a snack in India.",
    "region": "North India",
    "type": "Snack"
  },
  {
    "id": "7",
    "text": "Paneer butter masala is a creamy tomato-based curry made with Indian cottage cheese.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "8",
    "text": "Masala dosa is a thin, crispy fermented crepe filled with spicy mashed potatoes.",
    "region": "South India",
    "type": "Breakfast"
  },
  {
    "id": "9",
    "text": "Chole is a spicy chickpea curry from North India, often eaten with rice or bhature.",
    "region": "North India",
    "type": "Main Course"
  },
  {
    "id": "10",
    "text": "Rasgulla is a spongy dessert made from ball-shaped dumplings of chhena cooked in light syrup.",
    "region": "Bengal",
    "type": "Dessert"
  },
  {
    "id": "11",
    "text": "Naan is a soft and fluffy flatbread that is traditionally baked in a tandoor.",
    "region": "North India",
    "type": "Bread"
  },
  {
    "id": "12",
    "text": "Tandoori chicken is chicken marinated in yogurt and spices, roasted in a tandoor.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "13",
    "text": "Gulab jamun is a deep-fried milk-solid ball soaked in sweet syrup, served as dessert.",
    "region": "India",
    "type": "Dessert"
  },
  {
    "id": "14",
    "text": "Pav bhaji is a spicy vegetable mash served with soft buttered buns.",
    "region": "Mumbai",
    "type": "Snack"
  },
  {
    "id": "15",
    "text": "Raita is a yogurt-based condiment that cools down spicy dishes.",
    "region": "India",
    "type": "Condiment"
  },
  {
    "id": "16",
    "text": "Dhokla is a soft and fluffy savory cake made from fermented rice and chickpea flour.",
    "region": "Gujarat",
    "type": "Snack"
  },
  {
    "id": "17",
    "text": "Butter chicken is a rich tomato gravy dish with tender pieces of marinated chicken.",
    "region": "Delhi",
    "type": "Main Course"
  },
  {
    "id": "18",
    "text": "Lassi is a cold yogurt drink blended with sugar, salt, or fruits like mango.",
    "region": "Punjab",
    "type": "Drink"
  }, 
   {
    "id": "19",
    "text": "Momo is a type of South Asian dumpling popular in Nepal, filled with meat or vegetables and served with spicy chutney.",
    "region": "Nepal",
    "type": "Snack"
  },
  {
    "id": "20",
    "text": "Sel roti is a traditional homemade, sweet, ring-shaped rice bread from Nepal.",
    "region": "Nepal",
    "type": "Dessert"
  },
  {
    "id": "21",
    "text": "Hilsa curry is a traditional Bengali dish made with hilsa fish and mustard gravy.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "22",
    "text": "Bhuna khichuri is a spiced rice and lentil dish often served with beef curry in Bangladesh.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "23",
    "text": "Nihari is a slow-cooked stew of beef or lamb, eaten as breakfast in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "24",
    "text": "Chicken Karahi is a spicy curry cooked in a wok-like pan called a karahi, popular in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "25",
    "text": "Pad Thai is a stir-fried noodle dish with shrimp, peanuts, and tamarind sauce, one of Thailand's national dishes.",
    "region": "Thailand",
    "type": "Main Course"
  },
  {
    "id": "26",
    "text": "Tom Yum is a hot and sour Thai soup made with shrimp, lemongrass, and lime juice.",
    "region": "Thailand",
    "type": "Soup"
  },
  {
    "id": "27",
    "text": "Pho is a Vietnamese noodle soup consisting of broth, rice noodles, herbs, and meat.",
    "region": "Vietnam",
    "type": "Soup"
  },
  {
    "id": "28",
    "text": "Nasi Goreng is Indonesian-style fried rice often cooked with kecap manis, garlic, shallots, and chili.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "29",
    "text": "Rendang is a spicy meat dish slow-cooked in coconut milk and spices, originating from Indonesia.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "30",
    "text": "Nasi lemak is Malaysia's national dish consisting of fragrant rice cooked in coconut milk, served with sambal, anchovies, and egg.",
    "region": "Malaysia",
    "type": "Main Course"
  },
  {
    "id": "31",
    "text": "Adobo is a Filipino dish made by marinating meat in vinegar, soy sauce, and garlic, then simmering it.",
    "region": "Philippines",
    "type": "Main Course"
  },
  {
    "id": "32",
    "text": "Halo-halo is a Filipino dessert made from crushed ice, evaporated milk, and mixed ingredients like sweet beans, fruits, and jellies.",
    "region": "Philippines",
    "type": "Dessert"
  }, 
    {
    "id": "33",
    "text": "Peking duck is a famous Beijing dish featuring crispy roasted duck served with pancakes, hoisin sauce, and scallions.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "34",
    "text": "Kung Pao chicken is a spicy stir-fry dish made with chicken, peanuts, vegetables, and chili peppers.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "35",
    "text": "Mapo tofu is a Sichuan dish featuring soft tofu in a spicy chili and bean-based sauce, typically with minced pork.",
    "region": "Sichuan, China",
    "type": "Main Course"
  },
  {
    "id": "36",
    "text": "Xiao long bao are Chinese soup dumplings filled with meat and hot broth, typically served in a bamboo steamer.",
    "region": "Shanghai",
    "type": "Snack"
  },
  {
    "id": "37",
    "text": "Chow mein is a stir-fried noodle dish made with vegetables and sometimes meat or seafood.",
    "region": "China",
    "type": "Noodle"
  },
  {
    "id": "38",
    "text": "Hot and sour soup is a Chinese soup made with mushrooms, tofu, bamboo shoots, and egg, flavored with vinegar and white pepper.",
    "region": "China",
    "type": "Soup"
  },
  {
    "id": "39",
    "text": "Dim sum refers to a variety of small Chinese dishes served with tea, including dumplings, buns, and rolls.",
    "region": "Cantonese, China",
    "type": "Snack"
  },
  {
    "id": "40",
    "text": "Mooncake is a traditional Chinese pastry filled with lotus seed paste or red bean, eaten during the Mid-Autumn Festival.",
    "region": "China",
    "type": "Dessert"
  }, 
  {
  "id": "41",
  "text": "Kimchi is a traditional Korean side dish made from fermented vegetables, usually cabbage and radish, with chili pepper and garlic.",
  "region": "Korea",
  "type": "Side Dish"
},
{
  "id": "42",
  "text": "Bibimbap is a Korean mixed rice dish topped with sautéed vegetables, sliced meat, a fried egg, and chili paste.",
  "region": "Korea",
  "type": "Main Course"
},
{
  "id": "43",
  "text": "Tteokbokki is a popular Korean street food made of chewy rice cakes in a spicy red sauce.",
  "region": "Korea",
  "type": "Snack"
}, 
{
  "id": "44",
  "text": "Beef noodle soup is a beloved Taiwanese dish made with braised beef, vegetables, and noodles in a flavorful broth.",
  "region": "Taiwan",
  "type": "Soup"
},
{
  "id": "45",
  "text": "Lu rou fan is a classic Taiwanese comfort food of minced pork belly cooked in soy sauce, served over rice.",
  "region": "Taiwan",
  "type": "Main Course"
},
{
  "id": "46",
  "text": "Bubble tea is a Taiwanese drink made with tea, milk, and chewy tapioca pearls.",
  "region": "Taiwan",
  "type": "Drink"
}, 
{
  "id": "47",
  "text": "Char siu is a Cantonese-style barbecued pork known for its sweet and savory glaze.",
  "region": "Hong Kong",
  "type": "Main Course"
},
{
  "id": "48",
  "text": "Egg tarts are a popular Hong Kong dessert consisting of a flaky pastry crust filled with egg custard.",
  "region": "Hong Kong",
  "type": "Dessert"
},
{
  "id": "49",
  "text": "Wonton noodles are a Hong Kong dish made with thin egg noodles and wontons in a clear broth.",
  "region": "Hong Kong",
  "type": "Noodle"
}, 
{
  "id": "50",
  "text": "Meat pie is an iconic Australian dish consisting of a flaky pastry filled with minced meat and gravy.",
  "region": "Australia",
  "type": "Snack"
},
{
  "id": "51",
  "text": "Lamingtons are sponge cakes coated in chocolate and rolled in coconut, a popular Australian dessert.",
  "region": "Australia",
  "type": "Dessert"
} ,
{
  "id": "52",
  "text": "Pavlova is a meringue-based dessert topped with fresh fruit and cream, considered a national dish of New Zealand.",
  "region": "New Zealand",
  "type": "Dessert"
},
{
  "id": "53",
  "text": "Hangi is a traditional Māori method of cooking meat and vegetables in an underground oven.",
  "region": "New Zealand",
  "type": "Main Course"
},
{
  "id": "54",
  "text": "Palusami is a Polynesian dish of taro leaves filled with coconut cream and sometimes meat, baked in banana leaves.",
  "region": "Samoa, South Pacific",
  "type": "Main Course"
},
{
  "id": "55",
  "text": "Oka is a Samoan raw fish salad marinated in citrus and coconut milk, similar to ceviche.",
  "region": "Samoa, South Pacific",
  "type": "Appetizer"
},
{
  "id": "56",
  "text": "Lovo is a Fijian feast where food is wrapped in banana leaves and cooked in an earth oven.",
  "region": "Fiji, South Pacific",
  "type": "Main Course"
}
,
{
  "id": "57",
  "text": "Kokoda is a Fijian dish of raw fish marinated in lime juice and coconut milk, similar to ceviche.",
  "region": "Fiji, South Pacific",
  "type": "Appetizer"
},
{
  "id": "58",
  "text": "Poke is a Hawaiian dish of diced raw fish, typically seasoned with soy sauce and sesame oil.",
  "region": "Hawaii, USA",
  "type": "Appetizer"
},
{
  "id": "59",
  "text": "Spam musubi is a Hawaiian snack made of rice and Spam wrapped in seaweed.",
  "region": "Hawaii, USA",
  "type": "Snack"
},
{  "id": "60",
  "text": "Loco moco is a Hawaiian dish consisting of rice topped with a hamburger patty, fried egg, and brown gravy.",
  "region": "Hawaii, USA",
  "type": "Main Course"
},
{
  "id": "61",
  "text": "Sushi is a Japanese dish of vinegared rice combined with seafood, vegetables, and sometimes tropical fruits.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "62",
  "text": "Ramen is a Japanese noodle soup dish with Chinese-style wheat noodles served in a meat or fish-based broth.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "63",
  "text": "Tempura is a Japanese dish of seafood or vegetables that have been battered and deep-fried.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "64",
  "text": "Miso soup is a traditional Japanese soup consisting of a stock called dashi into which softened miso paste is mixed.",
  "region": "Japan",
  "type": "Soup"
},
{
  "id": "65",
  "text": "Okonomiyaki is a savory Japanese pancake containing a variety of ingredients.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "66",
  "text": "Hummus is a Middle Eastern dip or spread made from cooked, mashed chickpeas blended with tahini, olive oil, lemon juice, and garlic.",
  "region": "Middle East",
  "type": "Appetizer"
},
{
  "id": "67",
  "text": "Falafel consists of deep-fried balls of ground chickpeas or fava beans, typically served in pita bread.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "68",
  "text": "Shawarma is a Middle Eastern meat preparation where thin slices of lamb, chicken, or beef are stacked and roasted on a vertical rotisserie.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "69",
  "text": "Tabbouleh is a Levantine vegetarian salad made of finely chopped parsley, tomatoes, mint, and bulgur.",
  "region": "Middle East",
  "type": "Salad"
},
{
  "id": "70",
  "text": "Baklava is a rich, sweet dessert pastry made of layers of filo filled with chopped nuts and sweetened with syrup or honey.",
  "region": "Middle East",
  "type": "Dessert"
},
{
  "id": "71",
  "text": "Buuz are Mongolian steamed dumplings filled with minced meat, typically mutton or beef.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "72",
  "text": "Khorkhog is a Mongolian barbecue dish where meat is cooked with hot stones inside a sealed container.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "73",
  "text": "Airag is a traditional Mongolian alcoholic drink made from fermented mare's milk.",
  "region": "Mongolia",
  "type": "Beverage"
},
{
  "id": "74",
  "text": "Boortsog are Mongolian deep-fried cookies often served with tea or used as a dessert.",
  "region": "Mongolia",
  "type": "Dessert"
},
{
  "id": "75",
  "text": "Suutei tsai is a traditional Mongolian milk tea made with green tea, milk, water, and salt.",
  "region": "Mongolia",
  "type": "Beverage"
},
{
  "id": "76",
  "text": "Pizza is a flatbread topped with tomato sauce, cheese, and various toppings, baked in an oven.",
  "region": "Italy",
  "type": "Main Course"
},
{
  "id": "77",
  "text": "Banh xeo is a Vietnamese savory crepe made with rice flour, coconut milk, and turmeric, filled with shrimp, pork, and bean sprouts.",
  "region": "Vietnam",
  "type": "Main Course"
},
{
  "id": "78",
  "text": "Bun Cha is a famous Northern Vietnamese dish consisting of grilled pork patties and slices served with rice vermicelli, fresh herbs, and dipping fish sauce. The pork is marinated in garlic, shallots, and fish sauce before being grilled over charcoal. Popular street food often eaten for lunch in Hanoi, it's rich in protein and moderate fats, with herbs adding vitamins A and C.",
  "region": "Hanoi, Vietnam",
  "type": "Main Course"
},
{
  "id": "79",
  "text": "Goi Cuon, or Vietnamese fresh spring rolls, are translucent rice paper rolls filled with shrimp, pork, vermicelli noodles, and herbs. They are served with a peanut dipping sauce. The rolls are light, fresh, and perfect for warm climates. Often served at family gatherings and festive meals, they are low in calories, high in protein, fiber, and vitamin A.",
  "region": "Southern Vietnam",
  "type": "Appetizer"
},
{
  "id": "80",
  "text": "Com Tam means 'broken rice,' a dish made from fractured rice grains. It's served with grilled pork chop, fried egg, and pickled vegetables. The caramelized fish sauce enhances the flavor and aroma. A symbol of Saigon street food culture, it provides a good balance of carbohydrates, protein, and fats.",
  "region": "Southern Vietnam",
  "type": "Main Course"
},
{
  "id": "81",
  "text": "Pho Chay is a vegetarian version of Vietnam's iconic noodle soup. The broth is made from simmered daikon, carrots, onions, and mushrooms, giving a deep umami flavor. It's served with rice noodles, tofu, and a medley of fresh herbs. Commonly eaten by Buddhist vegetarians in Vietnam, it's high in plant-based protein, fiber, and antioxidants.",
  "region": "Vietnam",
  "type": "Soup"
},
{
  "id": "82",
  "text": "Oatmeal with Apples and Cinnamon is warm oatmeal cooked with apples, cinnamon, and a touch of honey, making a hearty and balanced breakfast. High in soluble fiber, it supports heart health and is vegetarian, with gluten-free options when using certified oats.",
  "region": "United Kingdom / USA",
  "type": "Breakfast"
},
{
  "id": "83",
  "text": "Lentil Soup is a protein-rich soup made from lentils, carrots, celery, and spices. It's both comforting and nourishing, perfect for cold days. An excellent source of protein, iron, and fiber, this vegan and gluten-free soup is both healthy and satisfying.",
  "region": "Middle East",
  "type": "Healthy Soup"
},
{
  "id": "84",
  "text": "Sushi Rolls consist of vinegared rice rolled with seaweed, vegetables, and raw or cooked seafood. They emphasize balance and presentation, central to Japanese cuisine and celebrations. High in omega-3 from fish, low fat, and rich in iodine, with vegetarian and gluten-free options available.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "85",
  "text": "Paella is a saffron-flavored rice dish cooked with seafood, chicken, and vegetables in a wide, shallow pan to achieve a crispy rice crust. A traditional dish from Valencia shared at family gatherings, it's high in protein, vitamin B12, and iron, and is gluten-free.",
  "region": "Spain",
  "type": "Main Course"
},
{
  "id": "86",
  "text": "Tacos al Pastor are filled with marinated pork roasted on a vertical spit and topped with pineapple, onions, and cilantro. The meat preparation is inspired by Middle Eastern shawarma. This iconic Mexican street food with Lebanese influence is high in protein with moderate fat.",
  "region": "Mexico",
  "type": "Street Food"
},
{
  "id": "87",
  "text": "Falafel Wrap consists of fried chickpea patties wrapped in pita bread with tahini sauce, pickles, and vegetables. They are crunchy outside and soft inside. A staple of Middle Eastern vegetarian cuisine, they're high in fiber and plant-based protein, and can be vegan if prepared without yogurt sauce.",
  "region": "Middle East",
  "type": "Vegetarian Main"
},
{
  "id": "88",
  "text": "Quinoa Salad with Chickpeas is a refreshing, protein-packed salad combining quinoa, chickpeas, fresh vegetables, and lemon dressing. It's ideal for those seeking plant-based nutrition. Quinoa is an ancient Andean grain used by the Incas, making this dish high in plant protein, fiber, iron, and magnesium.",
  "region": "South America",
  "type": "Healthy Meal"
},
{
  "id": "89",
  "text": "Greek Yogurt with berries and nuts is a wholesome combination of creamy yogurt, antioxidant-rich berries, and crunchy nuts. This meal promotes gut health and sustained energy. A staple of the Mediterranean diet, it's high in probiotics, calcium, and protein.",
  "region": "Greece",
  "type": "Healthy Snack"
},
  {
    "id": "90",
    "text": "Steamed Broccoli with Garlic and Olive Oil is a simple yet nutrient-dense side dish that retains the bright green color and crunch of broccoli while boosting flavor with garlic and olive oil. Rich in fiber, vitamin C, and antioxidants, this Mediterranean preparation is both vegan and gluten-free.",
    "region": "Mediterranean Region",
    "type": "Healthy Side Dish"
  },
  {
    "id": "91",
    "name": "Pad Thai",
    "category": "Main Course",
    "origin": "Thailand",
    "description": "Pad Thai is Thailand's most beloved stir-fried noodle dish, known for its balance of sweet, sour, salty, and spicy flavors. Thin rice noodles are stir-fried with tamarind paste, fish sauce, eggs, tofu, bean sprouts, and shrimp or chicken, topped with crushed peanuts and lime.",
    "ingredients": ["rice noodles", "shrimp/chicken", "eggs", "tofu", "bean sprouts", "fish sauce", "tamarind paste", "lime", "peanuts"],
    "cooking_method": "Stir-frying over high heat",
    "nutritional_benefits": "High in carbohydrates and protein, rich in vitamin C from lime, and healthy fats from peanuts",
    "cultural_background": "Originated during WWII when rice was scarce — the Thai government promoted noodles as a new staple food",
    "dietary_tags": ["contains shellfish", "contains peanuts", "contains gluten", "not vegan"]
  },
  {
    "id": "92",
    "name": "Greek Moussaka",
    "category": "Main Dish",
    "origin": "Greece",
    "description": "Moussaka is a layered Mediterranean casserole featuring sautéed eggplant, ground lamb, and creamy béchamel sauce. Each layer represents Greek comfort — warm, spiced meat beneath silky eggplant and golden baked topping.",
    "ingredients": ["eggplant", "minced lamb", "onions", "tomatoes", "cinnamon", "béchamel sauce"],
    "cooking_method": "Layering and baking",
    "nutritional_benefits": "High in protein, potassium, and antioxidants from eggplant",
    "cultural_background": "Traditionally served at family gatherings and Easter celebrations",
    "dietary_tags": ["contains dairy", "contains gluten", "not vegetarian"]
  },
  {
    "id": "93",
    "name": "Japanese Ramen",
    "category": "Soup / Main Dish",
    "origin": "Japan",
    "description": "Japanese Ramen is a soulful noodle soup combining chewy wheat noodles, flavorful broth, and toppings such as pork, nori, egg, and green onions. The type of broth—shoyu (soy), miso, or tonkotsu—defines the style.",
    "ingredients": ["wheat noodles", "pork bones", "soy sauce", "eggs", "seaweed", "scallions"],
    "cooking_method": "Simmering broth for hours; assembling noodles and toppings",
    "nutritional_benefits": "High in carbs and protein; minerals from broth",
    "cultural_background": "A symbol of Japanese street food innovation",
    "dietary_tags": ["contains gluten", "contains eggs", "contains soy", "not vegan"]
  },
  {
    "id": "94",
    "name": "Italian Risotto alla Milanese",
    "category": "Main Dish",
    "origin": "Italy",
    "description": "Risotto alla Milanese is a luxurious Northern Italian rice dish infused with saffron, butter, and Parmesan cheese. The creamy texture results from slowly stirring arborio rice with broth, releasing its starches.",
    "ingredients": ["arborio rice", "butter", "saffron", "onion", "white wine", "parmesan cheese"],
    "cooking_method": "Slow simmering with continuous stirring",
    "nutritional_benefits": "High in carbohydrates and calcium; saffron contains antioxidants",
    "cultural_background": "A signature dish of Milan, often paired with osso buco",
    "dietary_tags": ["contains dairy", "contains gluten", "vegetarian"]
  },
  {
    "id": "95",
    "name": "Mexican Enchiladas Verdes",
    "category": "Main Dish",
    "origin": "Mexico",
    "description": "Enchiladas Verdes are corn tortillas filled with chicken and covered with tangy green tomatillo sauce and cheese. They're baked until bubbling and served with crema and cilantro.",
    "ingredients": ["corn tortillas", "chicken", "tomatillos", "onion", "garlic", "cheese", "cilantro"],
    "cooking_method": "Baking and sauce preparation",
    "nutritional_benefits": "High in protein, vitamin C, and calcium",
    "cultural_background": "A national comfort dish symbolizing Mexico's colonial culinary fusion",
    "dietary_tags": ["contains dairy", "gluten-free if corn tortillas used"]
  },
  {
    "id": "96",
    "name": "Moroccan Couscous with Vegetables",
    "category": "Main Course",
    "origin": "Morocco",
    "description": "This fragrant North African dish features steamed couscous topped with tender vegetables and chickpeas simmered in spiced broth with cumin, turmeric, and cinnamon.",
    "ingredients": ["couscous", "chickpeas", "carrots", "zucchini", "raisins", "spices"],
    "cooking_method": "Steaming and stewing",
    "nutritional_benefits": "High in fiber, protein, and antioxidants",
    "cultural_background": "Traditionally shared during Friday family meals",
    "dietary_tags": ["vegan", "contains gluten"]
  },
  {
    "id": "97",
    "name": "French Ratatouille",
    "category": "Side / Main (Vegan)",
    "origin": "France",
    "description": "Ratatouille is a Provençal vegetable stew made from tomatoes, eggplant, zucchini, and bell peppers slowly cooked with herbs de Provence. It's celebrated for its simplicity and farm-fresh taste.",
    "ingredients": ["tomato", "eggplant", "zucchini", "bell pepper", "olive oil", "thyme"],
    "cooking_method": "Slow simmering",
    "nutritional_benefits": "Low-calorie, rich in fiber and vitamins A and C",
    "cultural_background": "Originally a peasant dish, now a French culinary icon",
    "dietary_tags": ["vegan", "gluten-free"]
  },
  {
    "id": "98",
    "name": "Indian Butter Chicken (Murgh Makhani)",
    "category": "Main Course",
    "origin": "India",
    "description": "Butter Chicken is a creamy tomato-based curry featuring tender marinated chicken simmered in butter and spices. Its mild flavor and silky texture make it globally popular.",
    "ingredients": ["chicken", "tomato", "cream", "butter", "garam masala", "ginger", "garlic"],
    "cooking_method": "Marinating, grilling, simmering in sauce",
    "nutritional_benefits": "Good protein source; calcium and vitamin A from dairy",
    "cultural_background": "Invented in Delhi; represents the Mughlai culinary legacy",
    "dietary_tags": ["contains dairy", "not vegetarian"]
  },
  {
    "id": "99",
    "name": "Chia Pudding with Berries",
    "category": "Breakfast / Dessert",
    "origin": "Global (Superfood)",
    "description": "Chia Pudding is a nutrient-rich dish made by soaking chia seeds in almond milk overnight, resulting in a creamy texture similar to tapioca. It's topped with berries, nuts, and honey.",
    "ingredients": ["chia seeds", "almond milk", "berries", "honey"],
    "cooking_method": "Cold soaking",
    "nutritional_benefits": "Rich in omega-3, fiber, and antioxidants",
    "cultural_background": "Modern superfood dish popular in health-conscious communities",
    "dietary_tags": ["vegan", "gluten-free", "dairy-free"]
  },
  {
    "id": "100",
    "name": "Buddha Bowl",
    "category": "Main Course",
    "origin": "Modern Western Health Cuisine",
    "description": "A Buddha Bowl is a colorful, balanced meal containing grains, greens, vegetables, and plant protein. Common bases include quinoa or brown rice topped with chickpeas, avocado, roasted veggies, and tahini sauce.",
    "ingredients": ["quinoa", "chickpeas", "avocado", "mixed vegetables", "tahini sauce"],
    "cooking_method": "Assembly of prepared components",
    "nutritional_benefits": "High in plant protein, fiber, healthy fats, and micronutrients",
    "cultural_background": "Modern health-focused dish popular in Western wellness culture",
    "dietary_tags": ["vegan", "gluten-free depending on grain", "may contain sesame"]
  },
  {
    "id": "101",
    "name": "Avocado Toast with Poached Egg",
    "category": "Breakfast",
    "origin": "Australia",
    "description": "Smashed avocado on whole-grain toast topped with poached egg, olive oil, and chili flakes is a popular health brunch dish.",
    "ingredients": ["avocado", "whole grain bread", "eggs", "olive oil", "chili flakes"],
    "cooking_method": "Toasting and poaching",
    "nutritional_benefits": "Contains heart-healthy fats, fiber, and protein",
    "cultural_background": "Became a brunch staple in Australian café culture",
    "dietary_tags": ["vegetarian", "contains gluten", "contains eggs"]
  },
  {
    "id": "102",
    "name": "Grilled Salmon with Quinoa and Greens",
    "category": "Main Dish",
    "origin": "Western Fusion",
    "description": "Grilled salmon served on a bed of quinoa, spinach, and roasted vegetables provides balanced nutrition with omega-3 fatty acids and complete protein.",
    "ingredients": ["salmon", "quinoa", "spinach", "mixed vegetables"],
    "cooking_method": "Grilling and assembly",
    "nutritional_benefits": "Excellent source of omega-3, B12, and antioxidants",
    "cultural_background": "Modern healthy fusion cuisine combining Western grilling with ancient grains",
    "dietary_tags": ["pescatarian", "gluten-free", "contains fish"]
  },
  {
    "id": "103",
    "name": "Kale and Apple Salad with Walnuts",
    "category": "Salad",
    "origin": "North America",
    "description": "Crunchy kale leaves are massaged with olive oil, then tossed with sliced apples, toasted walnuts, and lemon dressing.",
    "ingredients": ["kale", "apples", "walnuts", "olive oil", "lemon"],
    "cooking_method": "Raw preparation with massaging technique",
    "nutritional_benefits": "High in vitamin K, vitamin C, and healthy fats",
    "cultural_background": "Popular in North American health food movement",
    "dietary_tags": ["vegan", "gluten-free", "contains tree nuts"]
  },
  {
    "id": "104",
    "name": "Lentil and Vegetable Soup",
    "category": "Soup",
    "origin": "Mediterranean",
    "description": "A hearty, fiber-rich soup made from lentils, carrots, celery, and tomatoes simmered in vegetable broth.",
    "ingredients": ["lentils", "carrots", "celery", "tomatoes", "vegetable broth"],
    "cooking_method": "Simmering",
    "nutritional_benefits": "High in plant protein, iron, and soluble fiber",
    "cultural_background": "Traditional Mediterranean comfort food",
    "dietary_tags": ["vegan", "gluten-free"]
  },
  {
    "id": "105",
    "name": "Mac and Cheese",
    "category": "Main Dish",
    "origin": "USA",
    "description": "A classic American comfort dish of elbow macaroni baked with creamy cheddar cheese sauce and breadcrumbs. It evokes childhood nostalgia and communal warmth.",
    "ingredients": ["pasta", "cheese", "milk", "butter", "flour"],
    "cooking_method": "Baking with cheese sauce",
    "nutritional_benefits": "High in calcium and carbohydrates",
    "cultural_background": "American comfort food staple, often associated with childhood memories",
    "dietary_tags": ["contains dairy", "contains gluten"]
  },
  {
    "id": "106",
    "name": "Chicken Pot Pie",
    "category": "Main Dish",
    "origin": "United Kingdom / USA",
    "description": "Flaky pastry filled with creamy chicken and vegetable filling, often shared during cold seasons.",
    "ingredients": ["chicken", "pastry", "mixed vegetables", "cream", "herbs"],
    "cooking_method": "Baking in pastry crust",
    "nutritional_benefits": "High in protein and carbohydrates",
    "cultural_background": "Traditional British dish adapted in American cuisine, symbol of home cooking",
    "dietary_tags": ["contains gluten", "contains dairy", "not vegetarian"]
  },
  {
    "id": "107",
    "name": "Vietnamese Pho Bo",
    "category": "Soup",
    "origin": "Vietnam",
    "description": "Pho Bo is a traditional beef noodle soup known for its aromatic broth simmered with star anise, cinnamon, and herbs.",
    "ingredients": ["beef", "rice noodles", "star anise", "cinnamon", "herbs"],
    "cooking_method": "Long simmering of broth",
    "nutritional_benefits": "High in protein and minerals from bone broth",
    "cultural_background": "National dish of Vietnam, represents the soul of Vietnamese cuisine",
    "dietary_tags": ["contains gluten in noodles", "not vegetarian"]
  },
  {
    "id": "108",
    "name": "Korean Bibimbap",
    "category": "Main Dish",
    "origin": "Korea",
    "description": "Bibimbap mixes rice, sautéed vegetables, egg, and spicy gochujang sauce — symbolizing harmony of colors and flavors.",
    "ingredients": ["rice", "mixed vegetables", "egg", "gochujang", "sesame oil"],
    "cooking_method": "Assembly of cooked components",
    "nutritional_benefits": "Balanced meal with carbohydrates, protein, and vegetables",
    "cultural_background": "Represents Korean philosophy of balance and harmony in food",
    "dietary_tags": ["vegetarian option available", "contains sesame"]
  },
  {
    "id": "109",
    "name": "French Onion Soup",
    "category": "Soup",
    "origin": "France",
    "description": "Caramelized onions simmered in beef broth topped with bread and melted cheese — a symbol of rustic French warmth.",
    "ingredients": ["onions", "beef broth", "bread", "cheese", "herbs"],
    "cooking_method": "Caramelizing and simmering",
    "nutritional_benefits": "Contains antioxidants from onions and calcium from cheese",
    "cultural_background": "Classic French bistro dish, symbol of rustic cooking",
    "dietary_tags": ["contains dairy", "contains gluten"]
  },
  {
    "id": "110",
    "name": "Filipino Adobo",
    "category": "Main Dish",
    "origin": "Philippines",
    "description": "A national Filipino dish featuring chicken or pork simmered in vinegar, soy sauce, garlic, and bay leaves until tender and flavorful.",
    "ingredients": ["chicken or pork", "vinegar", "soy sauce", "garlic", "bay leaves"],
    "cooking_method": "Simmering in marinade",
    "nutritional_benefits": "High in protein with probiotics from vinegar",
    "cultural_background": "National dish of the Philippines, represents Filipino culinary identity",
    "dietary_tags": ["contains soy", "not vegan"]
  }
]